import pandas as pd
from tabulate import tabulate

# 创建一个包含数据的字典
data = {
    '单品名': [
        '红椒(2)', '七彩椒(2)', '枝江青梗散花', '菱角', '净藕(1)', '菠菜', '菠菜(份)', '螺丝椒', '紫茄子(1)', '云南油麦菜',
        '红莲藕带', '娃娃菜', '姜蒜小米椒组合装(小份)', '云南生菜', '云南生菜(份)', '白玉菇(袋)', '红薯尖', '双孢菇(盒)', '云南油麦菜(份)',
        '虫草花(份)', '菜心', '小米椒(份)', '木耳菜', '上海青', '外地茼蒿', '圆茄子(2)', '竹叶菜', '小皱皮(份)', '小青菜(1)', '木耳菜(份)', '奶白菜', '海鲜菇(包)'
    ],
    '数量': [2.5] * 32,
    '定价策略': [
        19.09731858, 19.18255755, 13.06013793, 14.16447433, 14.48864, 14.30595041, 5.90088998, 11.45323411,
        9.167727273, 7.468116279, 9.488671698, 6.580374142, 4.916914892, 9.408779762, 4.638277478, 5.799864,
        5.458074074, 5.032794444, 4.30762078, 3.76323396, 6.178695652, 5.889167724, 5.428687601, 8.164210526,
        12.79433166, 6.207619735, 3.935085923, 2.693981685, 5.307003984, 3.464351795, 4.952552479, 2.748387097
    ]
}

# 创建DataFrame
df = pd.DataFrame(data)

# 将DataFrame转换为列表
table = tabulate(df, headers='keys', tablefmt='fancy_grid')

# 打印列表
print(table)
